Repository: miranda-ng/miranda-ng
Catalog: tools/Langpack Suite/myRes.*.resx
Languages: be_by, cs_cz, de_de, ru_ru, uk_ua

# AssignLang
source: Langpack assigned...
be_by: Пакет абраны...
cs_cz: Překlad načten...
de_de: Sprachdatei zugeordnet...
ru_ru: Ленгпак выбран...
uk_ua: Ленгпак вибрано...

# AssignLangBtn
source: Assign
be_by: Абраць
cs_cz: Načíst
de_de: Zuordnung
ru_ru: Выбрать
uk_ua: Вибрати

# AutoModeBtn
source: Automatic
be_by: Аўтаматычны
cs_cz: Automaticky
de_de: Automatisch
ru_ru: Автоматический
uk_ua: Автоматичний

# ComFound
source: Commented lines founded...
be_by: Знойдзены закаментаваныя радкі...
cs_cz: Komentáře nalezeny...
de_de: Kommentare gefunden...
ru_ru: Найдены закомментированные строки...
uk_ua: Знайдені закоментовані рядки...

# CommentFindBtn
source: Find Commented
be_by: Пошук закаментаванага
cs_cz: Najít komentáře
de_de: Kommentare finden
ru_ru: Поиск закомментированного
uk_ua: Пошук закоментованного

# ComNotFound
source: Commented lines not found!
be_by: Закаментаваныя радкі не знойдзены!
cs_cz: Komentáře nenalezeny!
de_de: Kommentare nicht gefunden!
ru_ru: Закомментированные строки не найдены!
uk_ua: Закоментовані рядки не знайдені!

# CoreNotFound
source: File =CORE=.txt not found...
be_by: Файл =CORE=.txt не знойдзены...
cs_cz: Soubor =CORE=.txt nebyl nalezen...
de_de: Datei =CORE=.txt nicht gefunden...
ru_ru: Файл =CORE=.txt не найден...
uk_ua: Файл =CORE=.txt не знайден...

# CreateLangpackBtn
source: Create Langpack
be_by: Згенераваць пакет
cs_cz: Vygenerovat překlad
de_de: Sprachdatei erstellen
ru_ru: Сгенерировать ленгпак
uk_ua: Генорувати ленгпак

source: Done!
be_by: Выканана!
cs_cz: Hotovo!
de_de: Beendet!
ru_ru: Выполнено!
uk_ua: Виконано!

# DupesFindBtn
source: Find Dupes
be_by: Пошук дубляў
cs_cz: Najít duplikáty
de_de: Duplikate finden
ru_ru: Поиск дублей
uk_ua: Пошук дублів

# DupesNotFound
source: File =DUPES=.txt not found...
be_by: Файл =DUPES=.txt не знойдзены...
de_de: Datei =DUPES=.txt nicht gefunden...
ru_ru: Файл =DUPES=.txt не найден...

# DupFound
source: Dupes founded...
be_by: Дублі знойдзены...
cs_cz: Duplikáty nalezeny...
de_de: Duplikate gefunden...
ru_ru: Дубли найдены...
uk_ua: Дублі знайдені...

# DupNotFound
source: Dupes not found!
be_by: Дублі не знойдзены!
cs_cz: Duplikáty nenalezeny!
de_de: Duplikate nicht gefunden!
ru_ru: Дубли не найдены!
uk_ua: Дублі не знайдені!

# DupStop
source: Working stoped.
be_by: Праца спынена.
cs_cz: Zpracování ukončeno.
de_de: Arbeit beendet.
ru_ru: Работа остановлена.
uk_ua: Робота зупинина.

source: Error
be_by: Памылка
cs_cz: Chyba
de_de: Fehler
ru_ru: Ошибка
uk_ua: Помилка

# File2NotFound
source: .txt not found...
be_by: .txt не знойдзены...
cs_cz: .txt nenalezen...
de_de: .txt nicht gefunden...
ru_ru: .txt не найден...
uk_ua: .txt не знайдено...

# FileNotFound
source: not found...
be_by: не знойдзены...
cs_cz: nenalezen...
de_de: nicht gefunden...
ru_ru: не найден...
uk_ua: не знайдено...

# FileText
source: File
be_by: Файл
cs_cz: Soubor
de_de: Datei
ru_ru: Файл
uk_ua: Файл

# FindLang
source: Finding Langpack...
be_by: Пошук пакета...
cs_cz: Hledání překladu...
de_de: Finde Sprachdatei...
ru_ru: Поиск ленгпака...
uk_ua: Пошук ленгпака...

# GenStop
source: Generation stopped.
be_by: Генерацыя спынена.
cs_cz: Generování zastaveno.
de_de: Generierung gestoppt.
ru_ru: Генерация остановлена.
uk_ua: Генерація зупинина.

# GenText
source: Generating langpack...
be_by: Генерацыя пакета...
cs_cz: Generování překladu...
de_de: Sprachdatei erstellen...
ru_ru: Генерация ленгпака...
uk_ua: Генерація ленгпака...

# groupBox1
source: Assign Langpack File
be_by: Выбар файла пакета
cs_cz: Načíst soubor s překladem
de_de: Sprachdatei zuordnen
ru_ru: Выбор файла ленгпака
uk_ua: Вибір файлу ленгпака

# groupBox2
source: Output File
be_by: Файл выніку
cs_cz: Výsledný překlad
de_de: Ausgabedatei
ru_ru: Файл результата
uk_ua: Файл результату

# groupBox5
source: Working mode
be_by: Рэжым працы
cs_cz: Režim zpracování
de_de: Arbeitsmodus
ru_ru: Режим работы
uk_ua: Режим роботи

# HeadNotFound
source: File =HEAD=.txt not found...
be_by: Файл =HEAD=.txt не знойдзены...
cs_cz: Soubor =HEAD=.txt nenalezen...
de_de: Datei =HEAD=.txt nicht gefunden...
ru_ru: Файл =HEAD=.txt не найден...
uk_ua: Файл =HEAD=.txt не знайдено...

# Inf
source: Information
be_by: Інфармацыя
cs_cz: Informace
de_de: Informationen
ru_ru: Информация
uk_ua: Інформація

# label1
source: Langpack File Name:
be_by: Назва пакета:
cs_cz: Název souboru:
de_de: Sprachdatei Dateiname:
ru_ru: Название ленгпака:
uk_ua: Назва ленгпака:

# label2
source: Name:
be_by: Імя:
cs_cz: Název:
ru_ru: Имя:
uk_ua: Ім'я:

# label3
source: LinkList.txt file contains links to the translation files of different plugins and can be used in any download manager. Downloaded files can be used to generate a complete localization or consisting only from localization of plugins used by you (information is taken from the version info file, if available).
be_by: Файл LinkList.txt утрымоўвае спасылкі на асобныя файлы лакалізацыі і можа быць скарыстаны ў любой праграме для загрузкі файлаў з сеткі. Загружаныя файлы могуць быць скарыстаны для генерацыі поўнай лакалізацыі ці якая складаецца толькі з выкарыстоўваных Вамі модуляў (інфармацыя будзе ўзята з version info файла, пры яго наяўнасці).
cs_cz: Soubor LinkList.txt obsahuje odkazy na soubory s překlady jednotlivých doplňků a může být použit v jakémkoli download manažeru. Stažené soubory mohou být použity pro vygenerování kompletního překladu nebo také překladu pouze těch doplňků, které používáte (tato informace je získána ze souboru VersionInfo, pokud existuje).
de_de: LinkList.txt Datei beinhaltet Links zu den Übersetzungsdateien verschiedener Plugins und kann in jedem Download-Manager verwendet werden. Aus den heruntergeladenen Dateien kann einer Übersetzung aller, oder nur der von Ihnen verwendeten Plugins erstellt werden (Informationen werden aus Ihrer Versionsinfo-Datei ausgelesen, falls verfügbar).
ru_ru: Файл LinkList.txt содержит ссылки на отдельные файлы локализации и может быть использован в любой программе для загрузки файлов из сети. Загруженные файлы могут быть использованы для генерации полной локализации или состоящей только из используемых Вами модулей (информация будет взята из version info файла, при его наличии).
uk_ua: Файл LinkList.txt містить посилання на окремі файли локалізації і може бути використаний в будь-якій програмі для завантаження файлів з мережі. Завантажені файли можуть бути використані для створення повної локалізації або складається тільки з використовуваних Вами модулів (інформація взята з version info файлу, при його наявності).

# label4
source: URL of SVN:
be_by: URL сайта з зыходнікамі:
cs_cz: URL k SVN:
de_de: URL des SVNs:
ru_ru: URL сайта с исходниками:
uk_ua: URL сайту з першоджерелами:

# LangNotFound
source: Langpack not Founded...
be_by: Пакет не знойдзены...
cs_cz: Překlad nebyl nalezen...
de_de: Sprachdatei nicht gefunden...
ru_ru: Ленгпак не найден...
uk_ua: Ленгпак не знайдено...

# LangPathLbl
source: not assigned
be_by: не абраны
cs_cz: soubor není načten
de_de: nicht belegt
ru_ru: не выбран
uk_ua: не выбран

# LanguageLbl
source: Language:
be_by: Мова інтэрфейсу:
cs_cz: Jazyk:
de_de: Sprache:
ru_ru: Язык интерфейса:
uk_ua: Мова інтерфейсу:

# LinkListGen
source: Generating LinkList...
be_by: Генерацыя LinkList...
cs_cz: Generování LinkListu...
de_de: LinkList erstellen...
ru_ru: Генерация LinkList...
uk_ua: Генерація LinkList...

# LinkListGenBtn
source: Create File
be_by: Стварыць файл
cs_cz: Vygenerovat soubor
de_de: Datei erstellen
ru_ru: Создать файл
uk_ua: Створити файл

# ManualModeBtn
source: Manual
be_by: Ручны
cs_cz: Manuálně
de_de: Manuell
ru_ru: Ручной
uk_ua: Ручний

# NotOpen
source: Can not open file.
be_by: Немагчыма адкрыць файл.
cs_cz: Nelze otevřít soubor.
de_de: Kann Datei nicht öffnen.
ru_ru: Невозможно открыть файл.
uk_ua: Неможливо відкрити файл.

# NotTransFound
source: Not Translated lines founded...
be_by: Знойдзены неперакладзеныя радкі...
cs_cz: Nepřeložené řetězce nalezeny...
ru_ru: Найдены непереведённые строки...
uk_ua: Знайдені неперекладені рядки...

# NotTranslFindBtn
source: Find Not Translated
be_by: Пошук неперакладзенага
cs_cz: Najít nepřeložené
ru_ru: Поиск непереведенного
uk_ua: Пошук неперекладеного

# NotTransNotFound
source: Not translated lines not found!
be_by: Неперакладзеныя радкі не знойдзены!
cs_cz: Nepřeložené řetězce nebyly nalezeny!
ru_ru: Непереведённые строки не найдены!
uk_ua: Неперекладені рядки не знайдені!

# NotWrite
source: Can not write file.
be_by: Немагчыма запісаць файл.
cs_cz: Nelze zapisovat do souboru.
de_de: Kann Datei nicht schreiben.
ru_ru: Невозможно записать файл.
uk_ua: Неможливо записати файл.

# OwnFileCheckBox
source: Add your own file to Langpack
be_by: Дадаць свой файл у пакет
cs_cz: Připojit vlastní soubor k překladu
de_de: Eigene Datei zur Sprachdatei hinzufügen
ru_ru: Добавить свой файл в ленгпак
uk_ua: Додати свій файл до ленгпаку

# PlugLink
source: Writing files from Plugins folder...
be_by: Запіс файлаў з тэчкі Plugins...
cs_cz: Zapisování souborů ze složky Plugins...
ru_ru: Запись файлов из папки Plugins...
uk_ua: Запис файлів з папки Plugins...

# RootLink
source: Writing files from Root folder...
be_by: Запіс файлаў з каранёвай тэчкі...
cs_cz: Zapisování souborů z kořenové složky...
de_de: Schreiben von Dateien aus Root Ordner ...
ru_ru: Запись файлов из корневой папки...
uk_ua: Запис файлів з кореневої папки...

# SelectOwnFileBtn
source: Select
be_by: Абраць
cs_cz: Vybrat
de_de: Auswählen
ru_ru: Выбрать
uk_ua: Вибрати

# tabPage1
source: Generator
be_by: Генератар
cs_cz: Generátor překladu
ru_ru: Генератор
uk_ua: Генератор

# tabPage2
source: LinkListGen
be_by: Спіс файлаў
cs_cz: Generátor odkazů
de_de: Liste der Dateien
ru_ru: Список файлов
uk_ua: Список файлів

# tabPage3
source: Dupes Search
be_by: Пошук дубляў
cs_cz: Hledání duplikátů
de_de: Duplikate suchen
ru_ru: Поиск дублей
uk_ua: Пошук дублів

# VersionNotFound
source: File =VERSION=.txt not found...
be_by: Файл =VERSION=.txt не знойдзены...
cs_cz: Soubor =VERSION=.txt nenalezen...
de_de: Datei =VERSION=.txt nicht gefunden...
ru_ru: Файл =VERSION=.txt не найден...
uk_ua: Файл =VERSION=.txt не знайден...

# VIGen
source: File VersionInfo.txt founded, making short langpack...
be_by: Знойдзены файл VersionInfo.txt, будзе згенераваны кароткі пакет...
cs_cz: Soubor VersionInfo.txt nalezen, vytváření zkráceného překladu...
de_de: Datei VersionInfo.txt gefunden, making shot langpack...
ru_ru: Найден файл VersionInfo.txt, будет сгенерирован короткий ленгпак...
uk_ua: Знайдено файл VersionInfo.txt, буде сгенеровано короткий ленгпак...

# WeatherLink
source: Writing files from Weather folder...
be_by: Запіс файлаў з тэчкі Weather...
cs_cz: Zapisování souborů ze složky Weather...
de_de: Schreibe Dateien aus Weather Verzeichnis...
ru_ru: Запись файлов из папки Weather...
uk_ua: Запис файлів з папки Weather...

# WOVIGen
source: VersionInfo.txt not found, making full langpack...
be_by: VersionInfo.txt не знойдзены, будзе згенераваны поўны пакет...
cs_cz: Soubor VersionInfo.txt nenalezen, vytváření kompletního překladu...
de_de: VersionInfo.txt nicht gefunden, so dass volle langpack ...
ru_ru: VersionInfo.txt не найден, будет сгенерирован полный ленгпак...
uk_ua: VersionInfo.txt не знайдено, буде згенерировано повний ленгпак...

# WrongSelect
source: Selected wrong directory...
be_by: Тэчка абрана няслушна...
cs_cz: Vybrána neplatná složka...
de_de: Falsches Verzeichnis ausgewählt...
ru_ru: Папка выбрана неверно...
uk_ua: Папка обрана неправильно...

# PlugLinkNotFound
source: Subfolder Plugins not found...
be_by: Падтэчка Plugins не знойдзена...
cs_cz: Podsložka Plugins nenalezena...
de_de: Unterverzeichnis Plugins nicht gefunden...
ru_ru: Подпапка Plugins не найдена...
uk_ua: Підпапка Plugins не знайдена...

# WeatherLinkNotFound
source: Subfolder Weather not found...
be_by: Падтэчка Weather не знойдзена...
cs_cz: Podsložka Weather nenalezena...
de_de: Unterverzeichnis Weather nicht gefunden...
ru_ru: Подпапка Weather не найдена...
uk_ua: Підпапка Weather не знайдена...

# GetVICheckBox
source: Get VersionInfo from Internet or type full local path
be_by: Запампаваць файл VI з Інтэрнэту ці поўны шлях
cs_cz: Načíst VersionInfo z internetu nebo z lokálního souboru
de_de: VersionInfo aus Internet oder vollen lokalen Pfad
ru_ru: Скачать файл ВИ с Интернета или полный путь
uk_ua: Завантажити файл ВІ з Інтернету або повніий шлях

# label6
source: e.g. http://vi.miranda-ng.org/detail/mataes
be_by: напрыклад, http://vi.miranda-ng.org/detail/mataes
cs_cz: např. http://vi.miranda-ng.org/detail/mataes
de_de: bspw. http://vi.miranda-ng.org/detail/mataes
ru_ru: например, http://vi.miranda-ng.org/detail/mataes
uk_ua: наприклад, http://vi.miranda-ng.org/detail/mataes

# tipper
source: Command line arguments list
be_by: Спіс аргументаў каманднага радка
cs_cz: Seznam argumentů příkazové řádky
de_de: Kommandozeilen-Argumente
ru_ru: Список аргументов командной строки
uk_ua: Список параметрів командного рядка

# VarHead
source: Arguments
be_by: Аргументы
cs_cz: Argumenty
de_de: Argumente
ru_ru: Аргументы
uk_ua: Аргументи

# VarText
source: \q - silent generate \n - Langpack file name or output Langpack path \o - Path for adding own File \u - link to VI from vi.miranda-ng.org or full local path \p - Available Langpack folder name Example, LangpackSuite.exe \q \nLang_Test \o"My Strings.txt" \uD:\Miranda\VersionInfo.txt \prussian
be_by: \q - ціхая генерацыя \n - імя файла пакета або шлях выходнага файла пакета \o - шлях да файла для ўключэння ў пакет \u - спасылка на VI з vi.miranda-ng.org ці поўны лакальны шлях \p - даступны моўнай пакет Прыклад, LangpackSuite.exe \q \nLang_Test \o"My Strings.txt" \uD:\Miranda\VersionInfo.txt \prussian
cs_cz: \q - Tiché generování \n - Název souboru s překladem nebo cesta pro výstup překladu \o - Cesta pro přidání vlastního souboru \u - Odkaz na VI z vi.miranda-ng.org nebo úplná cesta k souboru \p - Název složky s dostupným překladem Např.: LangpackSuite.exe \q \nLang_Test \o"Moje řetězce.txt" \uD:\Miranda\VersionInfo.txt \pczech
de_de: \q - stille Erzeugung \n - Dateiname der Sprachdatei oder Sprachdatei Ausgabepfad \o - Pfad zu Hinzufügen eigener Datei \u - Link zu VI von vi.miranda-ng.org oder voller lokaler Pfad \p - Verfügbare Langpack Ordnernamen Beispiel LangpackSuite.exe \q \pgerman \nLang_Test \o"My Strings.txt" \uD:\Miranda\VersionInfo.txt
ru_ru: \q - тихая генерация \n - имя файла ленгпака или путь выходного файла ленгпака \o - путь к файлу для включения в ленгпак \u - ссылка на ВИ с vi.miranda-ng.org или полный локальный путь \p - доступный языковой пакет Пример, LangpackSuite.exe \q \nLang_Test \o"My Strings.txt" \uD:\Miranda\VersionInfo.txt \prussian
uk_ua: \q - тиха генерація \n - ім'я файла ленгпака або шлях вихідного файлу ленгпаку \o - шлях до файлу для включення у ленгпак \u - Посилання на ВІ с vi.miranda-ng.org або повний локальний шлях \p - доступний мовний пакет Приклад, LangpackSuite.exe \q \nLang_Test \o"My Strings.txt" \uD:\Miranda\VersionInfo.txt \prussian

# AvailLangpacks
source: Available Langpacks:
be_by: Даступныя пакеты:
cs_cz: Dostupné překlady:
ru_ru: Доступные пакеты:
uk_ua: Доступні пакети:
